import configparser
import json
import os

from llms.gemini import Gemini
from llms.glm3 import ChatGlm3

BASE_DIR = os.path.dirname(os.path.abspath(__file__))


class ChatLlm:
    def __init__(self, ini=os.path.join(BASE_DIR, '../config/config.ini')):
        self.config = configparser.ConfigParser()
        self.config.read(ini, encoding="utf-8")

    def generate(self, llm_type, messages):
        """
        :param llm_type: gpt3.5 or gpt4 or azure
        :param messages: [{"role": "user", "content": "写一个hello world程序"}]
        :return:
        """
        analysis_response = ""
        if llm_type.startswith("gpt"):
            from llms.gpt import Gpt
            key = self.config.get(llm_type, "key")
            llm = Gpt(llm_type, key)

        elif llm_type.startswith("azure"):
            from llms.azure import Azure
            key = self.config.get(llm_type, "key")
            base = self.config.get(llm_type, "base")
            engine = self.config.get(llm_type, "engine")
            api_version = self.config.get(llm_type, "api_version")
            llm = Azure(api_version, key, base, engine)
        elif llm_type.startswith("glm3"):
            api_base = self.config.get(llm_type, "api_base")
            llm = ChatGlm3(api_base)
        elif llm_type.startswith("gemini"):
            llm = Gemini()
        else:
            raise Exception("llm type error")

        try:
            analysis_response = llm.generate(messages)
            json_response = json.loads(analysis_response)
        except Exception as e:
            # print("error=> " + str(e))
            json_response = analysis_response
        return json_response


if __name__ == '__main__':
    obj = ChatLlm()

    query_list = [
        "饮用水行业中，天猫销售额超过五百万中销量排名前三的品牌是哪些",
        "乳制品行业中，天猫销售额超过两千万且销量排名前三的品牌是什么",
        "天猫均价1000元以上，销售额最高且超过三千万的户外服饰品牌是什么",
        "京东香水行业销售额超过五百万时，均价最高的前三个品牌是什么",
        "护肤行业京东客单价在90~120元之间，销售额最高的前三个品牌有哪些",
        "潮玩动漫行业京东客单价超过一百块，销售额最高的前两个品牌",
        "天猫销售额在两千万以上且销售额同比增长超过20%的前五个户外服饰品牌有哪些",
        "办公设备行业销售额在三千万到四千万之间，销售额同比增速最快的品牌",
        "线上平台销售额最高的五个品牌中，销售额环比增速最快的前两个品牌",
        "线上平台销售额超过一亿且环比且环比增速最快的3个国产白酒品牌",
        "葡萄酒行业线上销售额销售额大于一千万时，其增速最快的前三个品牌",
        "啤酒行业线上销售额前三中，销售额增速最快的品牌是什么？",
        "2023年7月蜜雪冰城租金是多少",
        "自然堂 Chando上海坪效",
        "名创优品 Miniso西北地区租金",
        "昌盛大药房全国新关门店数",
        "23H1金六福珠宝重庆闭店率",
        "22Q4斯凯奇 Skechers全国二线城市新开门店数",
        "22年上半年阿迪达斯 Adidas华东地区门店面积",
        "博士眼镜新开门店数同比变化",
        "舞东风门店总数同比变化",
        "2022下半年唇笔抖音均价环比增长是多少",
        "足浴剂最近一年线上销量是多少",
        "2023年9月抖音平台女装配饰在CR5集中度环比？",
        "2023年上半年京东平台婴幼儿牛奶粉在CR10集中度是多少？",
        "2023Q3年京东平台纸尿裤在CR5的集中度同比增速？",
        "女装23年9月天猫折扣率是多少",
        "鞋柜23年Q3天猫销量同比增长",
        "蜂花22年抖音销售额是多少",
        "护手霜京东均价是多少",
        "2023年Q1弹拨乐器在天猫的折扣率是多少？",
        "2022敦煌乐器的销售量同比增速为？",
        "苹果 Apple天猫销售额",
        "魅族 Meizu天猫销量",
        "联想 Lenovo天猫均价增速如何",
        "华硕 Asus天猫销量增速如何",
        "华硕 Asus天猫销量增速如何",
        "华硕 Asus天猫销量增速如何",
        "惠普 Hp天猫销售额同比变化是什么",
        "三只松鼠 Three Squirrels京东销售额同比增长多少",
        "开心果京东集中度",
        "食品饮料中月饼京东均价",
        "2023Q2王小卤京东销量",
        "22年农夫山泉天猫销售额同比增速是多少",
        "22年农夫山泉天猫销量同比增速是多少",
        "22年H2农夫山泉天猫销售额环比增速是多少",
        "22年H2农夫山泉天猫销量环比增速是多少",
        "23年上半年烘干机京东销量是多少",
        "烘干机京东销量变化了多少",
        "烘干机京东销售额变化了多少",
        "吹风机京东销量变化了多少",
        "吹风机京东销售额变化了多少",
        "23年Q3烘干机京东销售额环比变化了多少",
        "23年9月吹风机京东销量同比变化了多少",
        "苏泊尔 Supor天猫销售额",
        "优衣库 Uniqlo天猫销量",
        "南极人 Nanjiren天猫均价",
        "西门子 Siemens天猫销量",
        "索尼 Sony京东销售额",
        "晨光文具 M&g京东销量",
        "23年Q1无人机京东客单价",
        "哈曼·卡顿 Harman kardon京东销量环比",
        "领带京东销量",
        "电动鼻毛修剪器京东均价",
        "调味品京东销售额",
        "22年Q3苏泊尔 Supor天猫销售额",
        "22年Q4优衣库 Uniqlo天猫销量",
        "22年Q1南极人 Nanjiren天猫均价",
        "22年西门子 Siemens天猫销量",
        "23年Q2苏泊尔 Supor天猫销售额同比变化是多少",
        "23年Q2优衣库 Uniqlo天猫销量环比变化是多少",
        "22年Q1南极人 Nanjiren天猫均价环比变化是多少",
        "23年西门子 Siemens天猫销售额同比变化是多少",
        "23Q3调味品京东销售额同比变化了多少",
        "百丽天猫销售额",
        "百丽京东销量",
        "江中食疗京东销售额变化",
        "五谷磨房天猫销量变化",
        "电热水器天猫销售额",
        "成人奶粉京东均价",
        "2023年Q2未来式天猫市占率",
        "22年Q4优勤天猫销量",
        "2023年帘香客天猫销售额同比变化",
        "2023年益伟京东销量同比变化",
        "2023年9月保暖内衣京东销售额",
        "2022年Q4睡裙京东睡裙的均价",
        "帽子京东销售额同比变化是什么",
        "布艺沙发京东均价同比变化",
        "2022Q4马丁靴京东集中度环比是什么",
        "2023年高帮鞋京东销量环比变化",
        "2023Q2年松糕鞋京东集中度环比变化",
        "2023年皮布沙发京东销售额环比变化",
        "23年班亚奴京东市占率同比变化是什么",
        "23年Q3汤丽柏琦京东市占率环比变化是什么",
        "海康威视销售额",
        "珈柔销售额",
        "朝宇销售额",
        "尚纸坊销售额",
        "按摩椅销售额",
        "按摩披肩销售额",
        "最近一年雅芳门店数量",
        "23年1月一心堂门店面积",
        "2022年海尔一线城市关店数",
        "蜜雪冰城门店数",
        "2022年4月一心堂全国闭店率",
        "2022年6月一心堂河北门店总数",
        "2022Q3京东便利店黑龙江新开门店数",
        "华莱士 Wallace门店总数",
        "美宜佳新开门店数",
        "海尔关店数",
        "绝味坪效",
        "2022年格力华南地区门店面积",
        "2023年易捷便利店门店总数",
        "最近一年古茗新开门店数",
        "紫燕百味鸡坪效",
        "海澜之家租金",
        "京东家电门店面积",
        "华莱士门店总数",
        "2023年沪上阿姨关店数",
        "2022年鱼你在一起门店面积",
        "2022年七月华莱士门店总数",
        "23年Q1美宜佳新开门店数",
        "2022年海尔关店数",
        "22年Q3百果园湖北店效",
        "22年Q3海澜之家租金",
        "2023年京东家电门店面积",
        "22年Q3瑞幸咖啡北京门店数",
        "最近一年书亦烧仙草江西门店数",
        "2023年好又多超市云南门店总数",
        "2023年樊文花一线城市坪效",
        "22年Q3百果园上海店效",
        "最近一年鹿角巷闭店率",
        "嗦螺螺蛳粉上海门店数",
        "茶百道和瑞幸在北京的门店数谁最多？",
        "23年Q1小天才江西租金环比增长",
        "23年6月华为租售比",
        "北京同仁堂坪效变化",
        "2023年易捷便利店福建门店总数",
        "23年Q2肯德基重庆计租面积变化",
        "肯德基门店数",
        "23年H1老凤祥闭店率变化",
        "蜜雪冰城全国门店数增速",
        "罗森上海租售比变化",
        "23Q2一只酸奶牛租金变化",
        "22年以纯门店数变化",
        "23年Q1华为四川新开门店数增速",
        "22年H2名创优品店效变化",
        "2022年古茗西南地区平均评分",
        "22Q3华莱士吉林门店面积增速",
        "23Q2华莱士天津坪效变化",
        "中田健身门店数",
        "国大药房新开门店数",
        "德克士坪效",
        "张亮麻辣烫租金",
        "苏宁易购全国门店总数",
        "好又多超市一线城市新开门店数",
        "新华书店云南在营门店数",
        "屈臣氏 Watsons华北地区关店数",
        "植物医生 Dr.plant重庆新开门店数",
        "一点点二线城市门店面积",
        "周大福 Chow Tai Fook北京闭店率",
        "自然堂 Chando上海坪效",
        "名创优品 Miniso西北地区租金",
        "昌盛大药房全国新关门店数",
        "23H1金六福珠宝重庆闭店率",
        "22Q4斯凯奇 Skechers全国二线城市新开门店数",
        "22年上半年阿迪达斯 Adidas华东地区门店面积",
        "博士眼镜新开门店数同比变化",
        "舞东风门店总数同比变化",
        "海伦司小酒馆 Helens闭店率变化",
        "春天大药房新开门店数环比增速",
        "东莞国药门店总数环比变化",
        "杨国福麻辣烫店效环比增速",
        "良品铺子店效同比变化",
        "老乡鸡门店面积同比增速",
        "柠檬工坊关店数环比增速",
        "老麻抄手门店数同比变化",
        "安踏 Anta门店面积环比增速",
        "夸父炸串坪效环比变化",
        "鸿星尔克 Erke坪效同比变化",
        "必胜客 Pizza hut全国坪效增速",
        "回力 Warrior华北地区门店数量同比变化",
        "幸运咖 Lucky Cup全国店效增速是多少",
        "宝岛眼镜西南地区租金同比变化",
        "贡茶 Gongcha全国门店面积环比变化是多少",
        "杨国福麻辣烫华南地区坪效同比变化",
        "星巴克 Starbucks东北地区新开门店数量同比变化",
        "罗森 南京新开门店环比变化",
        "麦当劳云南新开门店总数环比变化",
        "苏宁易购在华东地区在营门店数环比变化",
        "2023年Q1和善园门店扩张增速是多少",
        "2022Q2牧场能量在营门店数环比变化",
        "22年Q1俄士厨房商场占比的同比变化",
        "2023年汤姆家的优质牛排评论数量同比",
        "23年6月沙野轻食在营门店数环比变化是多少",
        "23年Q1睿健卡路里新开门店数环比变化",
        "22年3月麦田归来轻食人均消费环比变化是什么",
        "2023Q3牧场能量在吉林在营门店数同比变化是什么",
        "2023年1月港岛记上海在营门店数同比变化是什么",
        "2022年Q4雅迪电动车全国闭店率变化是什么",
        "2023年1月新日电动车人均消费同比增长了多少",
        "22年绿源电动车一线城市人均消费同比增长是多少",
        "23年4月正新轮胎全国综合评分同比增长了多少",
        "22年Q4盘子女人坊全国店均评论数量同比变化",
        "23年9月西部牛排华东地区评分星级环比变化",
        "和善园在营门店数",
        "牧场能量的门店总数是多少",
        "牧场能量四川新关门店数量",
        "西部牛排安徽店效",
        "吉的堡少儿英语西北地区租金",
        "梦家园房产全国坪效",
        "23年9月大地影院租金",
        "2022Q2牧场能量在营门店数环比变化",
        "22年11月豪享来牛排覆盖率环比变化",
        "22年Q1俄士厨房商场占比的同比变化",
        "22年Q4诺丁牛排综合评分环比变化是多少",
        "2023年汤姆家的优质牛排评论数量同比",
        "23年6月沙野轻食在营门店数环比变化是多少",
        "2022年Q2江南里在江苏的店效",
        "华莱士 Wallace门店总数",
        "牧场能量闭店率变化",
        "明洞王妃家二线城市坪效",
        "2022年Q4弄堂里一线城市店效",
        "23年1月喜临门人均消费环比变化是什么",
        "2023年1月立邦人均消费同比增长了多少",
        "22年水星家纺一线城市人均消费同比增长是多少",
        "23年4月正新轮胎全国综合评分同比增长了多少",
        "22年Q4盘子女人坊全国店均评论数量同比变化",
        "23年9月西部牛排华东地区评分星级环比变化",
        "23年4月正新轮胎全国综合评分同比增长了多少"


    ]

    for query in query_list:
        prompt = _msg = f'''
        请判断以下问题“[输入问题]”属于哪个问题集。QueryListA是综合分析性问题,QueryListB是关于具体产品的数据查询性问题。若属于QueryListA,请回答“QueryListA”;若属于QueryListB,请回答“QueryListB”。判断标准包括:
        QueryListA的特征:
        通常需要对多个品牌进行横向对比排序分析
        提问条件复杂,需要同时考虑多个维度
        侧重挖掘洞察和关系

        QueryListB的特征：
        只关心单个或极少量品类的具体数值
        只询问单个或极少指标,如销量、销售额等
        没有要求提供TOP排名
        直接查询和提供要求的数据
        基于上述判断标准,只需要回答[QueryListA或者QueryListB], 不需要回答额外的内容

        输入问题：“{query}”
        '''
        result = obj.generate("glm3", [{"role": "user", "content": prompt}])
        # result = obj.generate("glm3", prompt)
        print(f"{query}: {result}")
